<?xml version="1.0" ?>
<net name="model" version="10">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data shape="1, 300, 200, 3" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="input">
					<dim>1</dim>
					<dim>300</dim>
					<dim>200</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="model/tf.__operators__.getitem/strided_slice/Concat9043037" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="model/tf.__operators__.getitem/strided_slice/Concat8849053013" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="32" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="model/tf.__operators__.getitem/strided_slice/Strides9063058" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="64" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="model/tf.__operators__.getitem/strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="0, 1, 1, 0" end_mask="0, 1, 1, 0" new_axis_mask="0, 0, 0, 0" shrink_axis_mask="0, 0, 0, 0" ellipsis_mask="0, 0, 0, 0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>300</dim>
					<dim>200</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16" names="model/tf.__operators__.getitem/strided_slice:0">
					<dim>1</dim>
					<dim>300</dim>
					<dim>200</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="model/tf.nn.bias_add/BiasAdd/bias:0" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 3" offset="96" size="6"/>
			<output>
				<port id="0" precision="FP16" names="model/tf.nn.bias_add/BiasAdd/bias:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="model/tf.nn.bias_add/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>300</dim>
					<dim>200</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model/tf.nn.bias_add/BiasAdd:0">
					<dim>1</dim>
					<dim>300</dim>
					<dim>200</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="79" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="102" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="model/vgg16/block1_conv1/BiasAdd__11" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>300</dim>
					<dim>200</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model/vgg16/block1_conv1/BiasAdd__11:0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="model/vgg16/block1_conv1/Conv2D/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f16" shape="64, 3, 3, 3" offset="134" size="3456"/>
			<output>
				<port id="0" precision="FP16" names="model/vgg16/block1_conv1/Conv2D/ReadVariableOp:0">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="model/vgg16/block1_conv1/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>200</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>300</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="model/vgg16/block1_conv1/BiasAdd/Dims739" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="3590" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="model/vgg16/block1_conv1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>300</dim>
					<dim>200</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model/vgg16/block1_conv1/BiasAdd:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>300</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="model/vgg16/block1_conv1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>300</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model/vgg16/block1_conv1/Relu:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>300</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="model/vgg16/block1_conv2/Conv2D/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 3, 3" offset="3718" size="73728"/>
			<output>
				<port id="0" precision="FP16" names="model/vgg16/block1_conv2/Conv2D/ReadVariableOp:0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="model/vgg16/block1_conv2/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>300</dim>
					<dim>200</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>300</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="model/vgg16/block1_conv2/BiasAdd/Dims805" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="77446" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="model/vgg16/block1_conv2/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>300</dim>
					<dim>200</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model/vgg16/block1_conv2/BiasAdd:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>300</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="model/vgg16/block1_conv2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>300</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model/vgg16/block1_conv2/Relu:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>300</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="model/vgg16/block1_pool/MaxPool" type="MaxPool" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>300</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model/vgg16/block1_pool/MaxPool:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>150</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="model/vgg16/block2_conv1/Conv2D/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f16" shape="128, 64, 3, 3" offset="77574" size="147456"/>
			<output>
				<port id="0" precision="FP16" names="model/vgg16/block2_conv1/Conv2D/ReadVariableOp:0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="model/vgg16/block2_conv1/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>150</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>150</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="model/vgg16/block2_conv1/BiasAdd/Dims745" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="225030" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="model/vgg16/block2_conv1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>150</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model/vgg16/block2_conv1/BiasAdd:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>150</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="model/vgg16/block2_conv1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>150</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model/vgg16/block2_conv1/Relu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>150</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="model/vgg16/block2_conv2/Conv2D/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128, 3, 3" offset="225286" size="294912"/>
			<output>
				<port id="0" precision="FP16" names="model/vgg16/block2_conv2/Conv2D/ReadVariableOp:0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="model/vgg16/block2_conv2/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>150</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>150</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="model/vgg16/block2_conv2/BiasAdd/Dims781" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128, 1, 1" offset="520198" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="model/vgg16/block2_conv2/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>150</dim>
					<dim>100</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model/vgg16/block2_conv2/BiasAdd:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>150</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="model/vgg16/block2_conv2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>150</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model/vgg16/block2_conv2/Relu:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>150</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="model/vgg16/block2_pool/MaxPool" type="MaxPool" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>150</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model/vgg16/block2_pool/MaxPool:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>75</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="model/vgg16/block3_conv1/Conv2D/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f16" shape="256, 128, 3, 3" offset="520454" size="589824"/>
			<output>
				<port id="0" precision="FP16" names="model/vgg16/block3_conv1/Conv2D/ReadVariableOp:0">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="model/vgg16/block3_conv1/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>75</dim>
					<dim>50</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>75</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="model/vgg16/block3_conv1/BiasAdd/Dims775" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1, 1" offset="1110278" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="model/vgg16/block3_conv1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>75</dim>
					<dim>50</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model/vgg16/block3_conv1/BiasAdd:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>75</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="model/vgg16/block3_conv1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>75</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model/vgg16/block3_conv1/Relu:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>75</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="model/vgg16/block3_conv2/Conv2D/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256, 3, 3" offset="1110790" size="1179648"/>
			<output>
				<port id="0" precision="FP16" names="model/vgg16/block3_conv2/Conv2D/ReadVariableOp:0">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="model/vgg16/block3_conv2/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>75</dim>
					<dim>50</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>75</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="model/vgg16/block3_conv2/BiasAdd/Dims757" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1, 1" offset="2290438" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="model/vgg16/block3_conv2/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>75</dim>
					<dim>50</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model/vgg16/block3_conv2/BiasAdd:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>75</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="model/vgg16/block3_conv2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>75</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model/vgg16/block3_conv2/Relu:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>75</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="model/vgg16/block3_conv3/Conv2D/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256, 3, 3" offset="2290950" size="1179648"/>
			<output>
				<port id="0" precision="FP16" names="model/vgg16/block3_conv3/Conv2D/ReadVariableOp:0">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="model/vgg16/block3_conv3/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>75</dim>
					<dim>50</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>75</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="model/vgg16/block3_conv3/BiasAdd/Dims793" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1, 1" offset="3470598" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="model/vgg16/block3_conv3/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>75</dim>
					<dim>50</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model/vgg16/block3_conv3/BiasAdd:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>75</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="model/vgg16/block3_conv3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>75</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model/vgg16/block3_conv3/Relu:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>75</dim>
					<dim>50</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="model/vgg16/block3_pool/MaxPool" type="MaxPool" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>75</dim>
					<dim>50</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model/vgg16/block3_pool/MaxPool:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>37</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="model/vgg16/block4_conv1/Conv2D/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f16" shape="512, 256, 3, 3" offset="3471110" size="2359296"/>
			<output>
				<port id="0" precision="FP16" names="model/vgg16/block4_conv1/Conv2D/ReadVariableOp:0">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="model/vgg16/block4_conv1/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>37</dim>
					<dim>25</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>37</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="model/vgg16/block4_conv1/BiasAdd/Dims799" type="Const" version="opset1">
			<data element_type="f16" shape="1, 512, 1, 1" offset="5830406" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="model/vgg16/block4_conv1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>37</dim>
					<dim>25</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model/vgg16/block4_conv1/BiasAdd:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>37</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="model/vgg16/block4_conv1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>37</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model/vgg16/block4_conv1/Relu:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>37</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="model/vgg16/block4_conv2/Conv2D/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f16" shape="512, 512, 3, 3" offset="5831430" size="4718592"/>
			<output>
				<port id="0" precision="FP16" names="model/vgg16/block4_conv2/Conv2D/ReadVariableOp:0">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="model/vgg16/block4_conv2/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>37</dim>
					<dim>25</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>37</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="model/vgg16/block4_conv2/BiasAdd/Dims769" type="Const" version="opset1">
			<data element_type="f16" shape="1, 512, 1, 1" offset="10550022" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="model/vgg16/block4_conv2/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>37</dim>
					<dim>25</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model/vgg16/block4_conv2/BiasAdd:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>37</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="model/vgg16/block4_conv2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>37</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model/vgg16/block4_conv2/Relu:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>37</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="model/vgg16/block4_conv3/Conv2D/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f16" shape="512, 512, 3, 3" offset="10551046" size="4718592"/>
			<output>
				<port id="0" precision="FP16" names="model/vgg16/block4_conv3/Conv2D/ReadVariableOp:0">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="model/vgg16/block4_conv3/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>37</dim>
					<dim>25</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>37</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="model/vgg16/block4_conv3/BiasAdd/Dims751" type="Const" version="opset1">
			<data element_type="f16" shape="1, 512, 1, 1" offset="15269638" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="model/vgg16/block4_conv3/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>37</dim>
					<dim>25</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model/vgg16/block4_conv3/BiasAdd:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>37</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="model/vgg16/block4_conv3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>37</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model/vgg16/block4_conv3/Relu:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>37</dim>
					<dim>25</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="model/vgg16/block4_pool/MaxPool" type="MaxPool" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>37</dim>
					<dim>25</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model/vgg16/block4_pool/MaxPool:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="model/vgg16/block5_conv1/Conv2D/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f16" shape="512, 512, 3, 3" offset="15270662" size="4718592"/>
			<output>
				<port id="0" precision="FP16" names="model/vgg16/block5_conv1/Conv2D/ReadVariableOp:0">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="model/vgg16/block5_conv1/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="model/vgg16/block5_conv1/BiasAdd/Dims811" type="Const" version="opset1">
			<data element_type="f16" shape="1, 512, 1, 1" offset="19989254" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="model/vgg16/block5_conv1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model/vgg16/block5_conv1/BiasAdd:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="model/vgg16/block5_conv1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model/vgg16/block5_conv1/Relu:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="model/vgg16/block5_conv2/Conv2D/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f16" shape="512, 512, 3, 3" offset="19990278" size="4718592"/>
			<output>
				<port id="0" precision="FP16" names="model/vgg16/block5_conv2/Conv2D/ReadVariableOp:0">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="model/vgg16/block5_conv2/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="model/vgg16/block5_conv2/BiasAdd/Dims787" type="Const" version="opset1">
			<data element_type="f16" shape="1, 512, 1, 1" offset="24708870" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="model/vgg16/block5_conv2/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model/vgg16/block5_conv2/BiasAdd:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="model/vgg16/block5_conv2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model/vgg16/block5_conv2/Relu:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="model/vgg16/block5_conv3/Conv2D/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f16" shape="512, 512, 3, 3" offset="24709894" size="4718592"/>
			<output>
				<port id="0" precision="FP16" names="model/vgg16/block5_conv3/Conv2D/ReadVariableOp:0">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="model/vgg16/block5_conv3/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>512</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="model/vgg16/block5_conv3/BiasAdd/Dims763" type="Const" version="opset1">
			<data element_type="f16" shape="1, 512, 1, 1" offset="29428486" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="model/vgg16/block5_conv3/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model/vgg16/block5_conv3/BiasAdd:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="model/vgg16/block5_conv3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model/vgg16/block5_conv3/Relu:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="model/vgg16/block5_pool/MaxPool" type="MaxPool" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>18</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="model/vgg16/block5_pool/MaxPool:0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="80" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="29429510" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="model/vgg16/block5_pool/MaxPool__46" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>9</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model/vgg16/block5_pool/MaxPool__46:0">
					<dim>1</dim>
					<dim>9</dim>
					<dim>6</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="const_fold_opt__48" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="29429542" size="16"/>
			<output>
				<port id="0" precision="I64" names="const_fold_opt__48">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="model/flatten/Reshape" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>9</dim>
					<dim>6</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model/flatten/Reshape:0">
					<dim>1</dim>
					<dim>27648</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="model/dense/MatMul/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f16" shape="128, 27648" offset="29429558" size="7077888"/>
			<output>
				<port id="0" precision="FP16" names="model/dense/MatMul/ReadVariableOp:0">
					<dim>128</dim>
					<dim>27648</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="model/dense/MatMul_Gemm__6/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>27648</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>27648</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="model/dense/BiasAdd/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="36507446" size="256"/>
			<output>
				<port id="0" precision="FP16" names="model/dense/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="model/dense/MatMul_Gemm__6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model/dense/MatMul_Gemm__6:0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="model/dense_1/MatMul/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f16" shape="3, 128" offset="36507702" size="768"/>
			<output>
				<port id="0" precision="FP16" names="model/dense_1/MatMul/ReadVariableOp:0">
					<dim>3</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="model/dense_1/MatMul_Gemm__7/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>3</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="model/dense_1/BiasAdd/ReadVariableOp:0" type="Const" version="opset1">
			<data element_type="f16" shape="1, 3" offset="36508470" size="6"/>
			<output>
				<port id="0" precision="FP16" names="model/dense_1/BiasAdd/ReadVariableOp:0">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="model/dense_1/MatMul_Gemm__7" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="model/dense_1/MatMul_Gemm__7:0">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="model/dense_1/Softmax/FlattenONNX_/Reshape/shape" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="36508476" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="model/dense_1/Softmax/FlattenONNX_/Reshape" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="output" type="SoftMax" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="output">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="output/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="4" to-port="0"/>
		<edge from-layer="1" from-port="0" to-layer="4" to-port="1"/>
		<edge from-layer="2" from-port="0" to-layer="4" to-port="2"/>
		<edge from-layer="3" from-port="0" to-layer="4" to-port="3"/>
		<edge from-layer="4" from-port="4" to-layer="6" to-port="0"/>
		<edge from-layer="5" from-port="0" to-layer="6" to-port="1"/>
		<edge from-layer="6" from-port="2" to-layer="8" to-port="0"/>
		<edge from-layer="7" from-port="0" to-layer="8" to-port="1"/>
		<edge from-layer="8" from-port="2" to-layer="10" to-port="0"/>
		<edge from-layer="9" from-port="0" to-layer="10" to-port="1"/>
		<edge from-layer="10" from-port="2" to-layer="12" to-port="0"/>
		<edge from-layer="11" from-port="0" to-layer="12" to-port="1"/>
		<edge from-layer="12" from-port="2" to-layer="13" to-port="0"/>
		<edge from-layer="13" from-port="1" to-layer="15" to-port="0"/>
		<edge from-layer="14" from-port="0" to-layer="15" to-port="1"/>
		<edge from-layer="15" from-port="2" to-layer="17" to-port="0"/>
		<edge from-layer="16" from-port="0" to-layer="17" to-port="1"/>
		<edge from-layer="17" from-port="2" to-layer="18" to-port="0"/>
		<edge from-layer="18" from-port="1" to-layer="19" to-port="0"/>
		<edge from-layer="19" from-port="1" to-layer="21" to-port="0"/>
		<edge from-layer="20" from-port="0" to-layer="21" to-port="1"/>
		<edge from-layer="21" from-port="2" to-layer="23" to-port="0"/>
		<edge from-layer="22" from-port="0" to-layer="23" to-port="1"/>
		<edge from-layer="23" from-port="2" to-layer="24" to-port="0"/>
		<edge from-layer="24" from-port="1" to-layer="26" to-port="0"/>
		<edge from-layer="25" from-port="0" to-layer="26" to-port="1"/>
		<edge from-layer="26" from-port="2" to-layer="28" to-port="0"/>
		<edge from-layer="27" from-port="0" to-layer="28" to-port="1"/>
		<edge from-layer="28" from-port="2" to-layer="29" to-port="0"/>
		<edge from-layer="29" from-port="1" to-layer="30" to-port="0"/>
		<edge from-layer="30" from-port="1" to-layer="32" to-port="0"/>
		<edge from-layer="31" from-port="0" to-layer="32" to-port="1"/>
		<edge from-layer="32" from-port="2" to-layer="34" to-port="0"/>
		<edge from-layer="33" from-port="0" to-layer="34" to-port="1"/>
		<edge from-layer="34" from-port="2" to-layer="35" to-port="0"/>
		<edge from-layer="35" from-port="1" to-layer="37" to-port="0"/>
		<edge from-layer="36" from-port="0" to-layer="37" to-port="1"/>
		<edge from-layer="37" from-port="2" to-layer="39" to-port="0"/>
		<edge from-layer="38" from-port="0" to-layer="39" to-port="1"/>
		<edge from-layer="39" from-port="2" to-layer="40" to-port="0"/>
		<edge from-layer="40" from-port="1" to-layer="42" to-port="0"/>
		<edge from-layer="41" from-port="0" to-layer="42" to-port="1"/>
		<edge from-layer="42" from-port="2" to-layer="44" to-port="0"/>
		<edge from-layer="43" from-port="0" to-layer="44" to-port="1"/>
		<edge from-layer="44" from-port="2" to-layer="45" to-port="0"/>
		<edge from-layer="45" from-port="1" to-layer="46" to-port="0"/>
		<edge from-layer="46" from-port="1" to-layer="48" to-port="0"/>
		<edge from-layer="47" from-port="0" to-layer="48" to-port="1"/>
		<edge from-layer="48" from-port="2" to-layer="50" to-port="0"/>
		<edge from-layer="49" from-port="0" to-layer="50" to-port="1"/>
		<edge from-layer="50" from-port="2" to-layer="51" to-port="0"/>
		<edge from-layer="51" from-port="1" to-layer="53" to-port="0"/>
		<edge from-layer="52" from-port="0" to-layer="53" to-port="1"/>
		<edge from-layer="53" from-port="2" to-layer="55" to-port="0"/>
		<edge from-layer="54" from-port="0" to-layer="55" to-port="1"/>
		<edge from-layer="55" from-port="2" to-layer="56" to-port="0"/>
		<edge from-layer="56" from-port="1" to-layer="58" to-port="0"/>
		<edge from-layer="57" from-port="0" to-layer="58" to-port="1"/>
		<edge from-layer="58" from-port="2" to-layer="60" to-port="0"/>
		<edge from-layer="59" from-port="0" to-layer="60" to-port="1"/>
		<edge from-layer="60" from-port="2" to-layer="61" to-port="0"/>
		<edge from-layer="61" from-port="1" to-layer="62" to-port="0"/>
		<edge from-layer="62" from-port="1" to-layer="64" to-port="0"/>
		<edge from-layer="63" from-port="0" to-layer="64" to-port="1"/>
		<edge from-layer="64" from-port="2" to-layer="66" to-port="0"/>
		<edge from-layer="65" from-port="0" to-layer="66" to-port="1"/>
		<edge from-layer="66" from-port="2" to-layer="67" to-port="0"/>
		<edge from-layer="67" from-port="1" to-layer="69" to-port="0"/>
		<edge from-layer="68" from-port="0" to-layer="69" to-port="1"/>
		<edge from-layer="69" from-port="2" to-layer="71" to-port="0"/>
		<edge from-layer="70" from-port="0" to-layer="71" to-port="1"/>
		<edge from-layer="71" from-port="2" to-layer="72" to-port="0"/>
		<edge from-layer="72" from-port="1" to-layer="74" to-port="0"/>
		<edge from-layer="73" from-port="0" to-layer="74" to-port="1"/>
		<edge from-layer="74" from-port="2" to-layer="76" to-port="0"/>
		<edge from-layer="75" from-port="0" to-layer="76" to-port="1"/>
		<edge from-layer="76" from-port="2" to-layer="77" to-port="0"/>
		<edge from-layer="77" from-port="1" to-layer="78" to-port="0"/>
		<edge from-layer="78" from-port="1" to-layer="80" to-port="0"/>
		<edge from-layer="79" from-port="0" to-layer="80" to-port="1"/>
		<edge from-layer="80" from-port="2" to-layer="82" to-port="0"/>
		<edge from-layer="81" from-port="0" to-layer="82" to-port="1"/>
		<edge from-layer="82" from-port="2" to-layer="84" to-port="0"/>
		<edge from-layer="83" from-port="0" to-layer="84" to-port="1"/>
		<edge from-layer="84" from-port="2" to-layer="86" to-port="0"/>
		<edge from-layer="85" from-port="0" to-layer="86" to-port="1"/>
		<edge from-layer="86" from-port="2" to-layer="88" to-port="0"/>
		<edge from-layer="87" from-port="0" to-layer="88" to-port="1"/>
		<edge from-layer="88" from-port="2" to-layer="90" to-port="0"/>
		<edge from-layer="89" from-port="0" to-layer="90" to-port="1"/>
		<edge from-layer="90" from-port="2" to-layer="92" to-port="0"/>
		<edge from-layer="91" from-port="0" to-layer="92" to-port="1"/>
		<edge from-layer="92" from-port="2" to-layer="93" to-port="0"/>
		<edge from-layer="93" from-port="1" to-layer="94" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2021.4.0-3839-cd81789d294-releases/2021/4"/>
		<cli_parameters>
			<caffe_parser_path value="DIR"/>
			<data_type value="FP16"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<disable_weights_compression value="False"/>
			<enable_concat_optimization value="True"/>
			<enable_flattening_nested_params value="False"/>
